Revit 2026 API

# View3DSetOrientation Method

---

Sets the temporary orientation of the View3D. The new orientation is not saved in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOrientation(
	ViewOrientation3D newViewOrientation3D
)
```
```vb
Public Sub SetOrientation (
	newViewOrientation3D As ViewOrientation3D
)
```
```cpp
public:
void SetOrientation(
	ViewOrientation3D^ newViewOrientation3D
)
```
```fsharp
member SetOrientation :
        newViewOrientation3D : ViewOrientation3D -> unit
```

#### Parameters

newViewOrientation3D ViewOrientation3D
     The new orientation to set.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | View is locked and cannot be reoriented. |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace